; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 279814 2 1 4 7 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	spectrograph3 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Star3 - direction
	Star0 - direction
	Star4 - direction
	Star2 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Planet7 infrared2)
	(have_image Star8 infrared2)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 image1)
	(have_image Star11 spectrograph3)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
4. (turn_to satellite1 star8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
5. (turn_to satellite1 star2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star2)
   goals met: 0 of 6
6. (turn_to satellite0 star0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
7. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (turn_to satellite1 star8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
10. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
11. (take_image satellite1 star8 instrument1 infrared2)
   added: (have_image star8 infrared2)
   goals met: 1 of 6
12. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 2 of 6
13. (turn_to satellite1 planet7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet7)
   goals met: 2 of 6
14. (turn_to satellite0 star11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star11)
   goals met: 2 of 6
15. (take_image satellite1 planet7 instrument1 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 3 of 6
16. (take_image satellite0 star11 instrument0 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 4 of 6
17. (turn_to satellite0 phenomenon10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 6
18. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 6
19. (turn_to satellite0 groundstation1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation1)
   goals met: 6 of 6
